Revit 2026 API
ExternalDataManagerChangedEventArgs Properties
The ExternalDataManagerChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
See Also
Reference
ExternalDataManagerChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace